---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.CurveByPointsUtils
source: html/d4e3a41c-2dd7-c57f-887a-46a100ea708d.htm
---
# CurveByPointsUtils Members

Adds The CurveElements to one or more FaceRegions.